lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_6_ID, CFG_SCH_PRIO_0);
              }
            }
            if (dev6 == 1)
            {
              /* Inform Application it is End Device 6 */
              APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 6\n");

              BleApplicationContext.EndDevice_Connection_Status[5] = APP_BLE_CONNECTED_CLIENT;
              BleApplicationContext.connectionHandleEndDevice6 = connection_handle;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[5] = connection_handle;
              handleNotification.P2P_Evt_Opcode = P2P_SERVER6_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle = connection_handle;
              Evt_Notification(&handleNotification);
              result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice6);
              if (result == BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
              }
              else
              {
                APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
              /* Now try to connect to device 5 */
              if ((BleApplicationContext.EndDevice_Connection_Status[4] != APP_BLE_CONNECTED_CLIENT)
                  && (BleApplicationContext.EndDevice5Found == 0x01))
              {

                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_5_ID, CFG_SCH_PRIO_0);
              }
            }

          /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_4 */
#endif
          }

          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n");
            BleApplicationContext.connectionHandleCentral = connection_handle;
            handleNotification.P2P_Evt_Opcode = SMART_PHONE1_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = connection_handle;
            Evt_Notification(&handleNotification);
          }

          break; /* HCI_EVT_LE_CONN_COMPLETE */

        case EVT_LE_ADVERTISING_REPORT:

          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
          The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
          Instead they must be read by using offsets (please refer to BLE specification).
          RSSI = *(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
          */
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

          /* search AD TYPE 0x09 (Complete Local Name) */
          /* search AD Type 0x02 (16 bits UUIDS) */
          if (event_type == ADV_IND || event_type == SCAN_RSP)
          {

            /* ISOLATION OF BD ADDRESS AND LOCAL NAME */

            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              adtype = adv_report_data[k + 1];
              char current_device_name[MAX_DEVICE_NAME_LENGHT];
              memset(current_device_name, 0, MAX_DEVICE_NAME_LENGHT);
              bool isStringFound = false;

              switch (adtype)
              {
                case 0x01: /* now get flags */
                /* USER CODE BEGIN get_flags */

                /* USER CODE END get_flags */
                break;
                case 0x09: /* now get local name */
                /* USER CODE BEGIN get_local_name */


                	for (int i=0; i<adlength;i++){
                		current_device_name[i] = adv_report_data[k+i+1];
					}

                	for(int j=0;j<scannedDevicesPackage.numberOfScannedDevices;j++){ //todo probleme avec numberofScannedDevices
                		if (strcmp(current_device_name, scannedDevicesPackage.scannedDevicesList[j].deviceName) == 0){
                			isStringFound = true;
                			break;
                		}
                	}
					if (isStringFound == false){
						strcpy(scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].deviceName, current_device_name);
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].pairingStatus = 0;
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].position = scannedDevicesPackage.numberOfScannedDevices;
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[0] = le_advertising_event->Advertising_Report[0].Address[0];
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[1] = le_advertising_event->Advertising_Report[0].Address[1];
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[2] = le_advertising_event->Advertising_Report[0].Address[2];
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[3] = le_advertising_event->Advertising_Report[0].Address[3];
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[4] = le_advertising_event->Advertising_Report[0].Address[4];
						scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].macAddress[5] = le_advertising_event->Advertising_Report[0].Address[5];

						printf("%s", scannedDevicesPackage.scannedDevicesList[scannedDevicesPackage.numberOfScannedDevices].deviceName);
						printf(" //////// %d /////////// new\n", scannedDevicesPackage.numberOfScannedDevices);
						scannedDevicesPackage.numberOfScannedDevices ++;
					}



                /* USER CODE END get_local_name */
                  break;
                case 0x02: /* now get UID */
                /* USER CODE BEGIN get_UID */

